/*
 *   Mitsubishi CP-D90DW Photo Printer CUPS backend
 *
 *   (c) 2019-2024 Solomon Peachy <pizza@shaftnet.org>
 *
 *   The latest version of this program can be found at:
 *
 *     https://git.shaftnet.org/gitea/slp/selphy_print.git
 *
 *   This program is free software; you can redistribute it and/or modify it
 *   under the terms of the GNU General Public License as published by the Free
 *   Software Foundation; either version 2 of the License, or (at your option)
 *   any later version.
 *
 *   This program is distributed in the hope that it will be useful, but
 *   WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 *   or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 *   for more details.
 *
 *   You should have received a copy of the GNU General Public License
 *   along with this program; if not, see <https://www.gnu.org/licenses/>.
 *
 *   SPDX-License-Identifier: GPL-2.0+
 *
 */

#define BACKEND mitsud90_backend

#include "backend_common.h"
#include "backend_mitsu.h"

/* CPM1 stuff */
#define CPM1_LAMINATE_STRIDE 1852

#define CPM1_LAMINATE_FILE "M1_MAT02.raw"
#define CPM1_CPC_FNAME "CPM1_N1.csv"
#define CPM1_CPC_G1_FNAME "CPM1_G1.csv"
#define CPM1_CPC_G5_FNAME "CPM1_G5.csv"
#define CPM1_CPC_G5_VIVID_FNAME "CPM1_G5_vivid.csv"
#define CPM1_LUT_FNAME "CPM1_NL.lut"

/* D90 LUT for when we are doing panoramas */
#define CPD90_LUT_FNAME "CPD90L01.lut"
#define CPD90_CPC_FNAME "CPD90_N1.csv"

#define W5K_STATUS_TYPE_x31     0x31 // 2, 00 44
#define W5K_STATUS_TYPE_x33     0x33 // 12, all 0
#define W5K_STATUS_TYPE_x34     0x34 // 2, 00 4f
#define W5K_STATUS_TYPE_x35     0x35 // 2, 02
#define W5K_STATUS_TYPE_x37     0x37 // 2, 02
#define W5K_STATUS_CNT_HEAD     0x3d // 4
#define W5K_STATUS_CNT_SERVICE  0x3e // 4
#define W5K_STATUS_CNT_PRINTED  0x3f // 4

#define W5K_STATUS_TYPE_x40     0x40 // 4, 00 00 3f b0 (seen it go up and down)
#define W5K_STATUS_TYPE_x45     0x45 // 4, 00 00 00 84 (counter?) <-- incremetns one per print
#define W5K_STATUS_TYPE_DENSITY 0x46 // 2
#define W5K_STATUS_TYPE_TPHR    0x4b // 2 // Thermal Print Head Resistance
#define W5K_STATUS_TYPE_TPHSN   0x4c // 8 // Thermal Print Head Serno (ASCII, non-terminated)

#define W5K_STATUS_TYPE_x52     0x52 // 1, 42
#define W5K_STATUS_CNT_CUTTER   0x5b

#define W5K_STATUS_CNT_SLITTER  0x60
#define COM_STATUS_TYPE_x65     0x65 // 50, see below (sensors?)
#define W5K_STATUS_TYPE_x65     0x65 // 54, see below
#define W5K_STATUS_TYPE_LENGTHS 0x6f // 16, BLANKLENA_s16, BLANKLENB_s16, 00 00, MARGINLEN s16, 00 00, CUTLEN_s16, 00 00 00 00

#define W5K_STATUS_TYPE_x70     0x70 // 16, 0a 07 ff 0b 00 00 00 00 00 00 00 00 00 00 00 00
#define W5K_STATUS_TYPE_MOTOR3  0x71 // 16, NN NN NN NN TT TT TT TT  00 00 00 00 00 00 00 00
#define W5K_STATUS_TYPE_MOTOR5  0x72 // 16, NN NN NN NN TT TT TT TT  00 00 00 00 00 00 00 00
#define W5K_STATUS_TYPE_MOTOR1  0x73 // 4, CC CC CC CC

#define D90_STATUS_TYPE_ISEREN  0x82 // 1,  80 (iserial disabled)
#define COM_STATUS_TYPE_x83     0x83 // 1,  00
#define W5K_STATUS_TYPE_x83     0x83 // 2, 00 80
#define D90_STATUS_TYPE_x84     0x84 // 1,  00
#define W5K_STATUS_TYPE_x84     0x84 // 2, 00 0a
#define D90_STATUS_TYPE_x85     0x85 // 2, 00 ?? BE, wait time? combined total of 5.
#define W5K_STATUS_TYPE_x85     0x85 // 2, 00 04
#define W5K_STATUS_TYPE_x86     0x86 // 2, 01 2c
#define W5K_STATUS_TYPE_DMAXY   0x87 // 1
#define W5K_STATUS_TYPE_DMINY   0x88 // 1
#define W5K_STATUS_TYPE_DMAXM   0x89 // 1
#define W5K_STATUS_TYPE_DMINM   0x8a // 1
#define W5K_STATUS_TYPE_DMAXC   0x8b // 1
#define W5K_STATUS_TYPE_DMINC   0x8c // 1
#define W5K_STATUS_TYPE_LUT     0x8d // 120, 53 4c 54 41 58 32 37 30 -- "SLTAX270" for older media type (vs "SLTA7180" for new media type), followed by 14 more entries for B1-7/C1-7
#define W5K_STATUS_TYPE_x8e     0x8e // 8, all ff

#define W5K_STATUS_TYPE_x97     0x97 // 2, 00 01

#define W5K_STATUS_TYPE_xc0     0xc0 // 1, 00
#define W5K_STATUS_TYPE_xc1     0xc1 // 1, 00
#define W5K_STATUS_TYPE_xc2     0xc2 // 1, 00
#define W5K_STATUS_TYPE_xc3     0xc3 // 1, 00
#define W5K_STATUS_TYPE_xc4     0xc4 // 1, 00
#define W5K_STATUS_TYPE_xc5     0xc5 // 1, 00
#define W5K_STATUS_TYPE_xc6     0xc6 // 1, 00
#define W5K_STATUS_TYPE_xc7     0xc7 // 1, 00
#define W5K_STATUS_TYPE_xc8     0xc8 // 1, 00
#define W5K_STATUS_TYPE_xc9     0xc9 // 1, 00
#define W5K_STATUS_TYPE_xca     0xca // 1, 00
#define W5K_STATUS_TYPE_xcb     0xcb // 1, 00
#define W5K_STATUS_TYPE_xcf     0xcf // 1, 00

struct mitsud90_fw_resp_single {
	uint8_t  version[6];
	uint16_t csum;
} __attribute__((packed));

struct mitsud90_media_resp {
	uint8_t  hdr[4];  /* e4 47 44 30 */
	struct {
		uint8_t  brand;
		uint8_t  type;
		uint8_t  unk_a[2];
		uint16_t capacity; /* BE */
		uint16_t remain;  /* BE */
		uint8_t  unk_b[2];
	} __attribute__((packed)) media; /* COM_STATUS_TYPE_MEDIA */
} __attribute__((packed));

struct mitsud90_status_resp {
	uint8_t  hdr[4];  /* e4 47 44 30 */
	/* COM_STATUS_TYPE_ERROR */
	uint8_t  code[2]; /* 00 is ok, nonzero is error */
	uint8_t  unk[9];
	/* COM_STATUS_TYPE_MECHA */
	uint8_t  mecha[2];
	/* COM_STATUS_TYPE_TEMP */
	uint8_t  temp;
} __attribute__((packed));

struct mitsud90_info_resp {
	uint8_t  hdr[4];  /* e4 47 44 30 */
	uint8_t  model[10];
	uint8_t  x02;
	struct mitsud90_fw_resp_single fw_vers[7];
	uint8_t  x1e;
	uint8_t  x22[2];
	uint16_t jobid;
	uint8_t  inkid[8];
	uint8_t  x2b[2];
	uint8_t  x2c[2];
	uint8_t  x65[50];
	uint8_t  iserial;
	uint8_t  x83;
	uint8_t  x84;
} __attribute__((packed));

struct mitsud90_fwver_resp {
	uint8_t  hdr[4];  /* e4 47 44 30 */
	struct mitsud90_fw_resp_single fw_ver;
} __attribute((packed));

struct mitsum1_info_resp {
	uint8_t  hdr[4];  /* e4 47 44 30 */
	uint8_t  model[10];
	uint8_t  x02;
	struct mitsud90_fw_resp_single fw_vers[8];
	uint8_t  x1e;
	uint8_t  x22[2];
	uint16_t jobid;
	uint8_t  inkid[8];
	uint8_t  x2b[2];
	uint8_t  x2c[2];
	uint8_t  x65[50];
	uint8_t  x83;
} __attribute__((packed));

struct mitsuw5k_info_resp {
	uint8_t  hdr[4];  /* e4 47 44 30 */
	uint8_t  model[5];
	uint8_t  x02;
	struct mitsud90_fw_resp_single fw_vers[7];
	uint8_t  x1a;
	uint8_t  x1e;
	uint8_t  inkid[8];
	uint8_t  x2b[8];
	uint8_t  x2c[12];
	uint32_t cnt_head;
	uint32_t cnt_service;
	uint32_t cnt_printed;
	uint32_t cnt_cutter;
	uint32_t cnt_slitter;
#if 0
	uint32_t x40;
	uint32_t x45;
	uint8_t  x65[54];
	uint8_t  x83[2];
	uint8_t  x84[2];
#endif
} __attribute__((packed));

#define D90_MECHA_STATUS_IDLE         0x00
#define W5K_MECHA_STATUS_PRINTING     0x20
#define D90_MECHA_STATUS_PRINTING     0x50
#define D90_MECHA_STATUS_INIT         0x80
#define D90_MECHA_STATUS_INIT_FEEDCUT 0x10

#define D90_MECHA_STATUS_PRINT_FEEDING 0x10  // feeding ?
#define D90_MECHA_STATUS_PRINT_x20     0x20  // ??
#define D90_MECHA_STATUS_PRINT_PRE_Y   0x21  // pre Y ?
#define D90_MECHA_STATUS_PRINT_Y       0x22  // Y ?
#define D90_MECHA_STATUS_PRINT_PRE_M   0x23  // pre M ?
#define D90_MECHA_STATUS_PRINT_M       0x24  // M ?
#define D90_MECHA_STATUS_PRINT_PRE_C   0x25  // pre C ? guess!
#define D90_MECHA_STATUS_PRINT_C       0x26  // C ?
#define D90_MECHA_STATUS_PRINT_PRE_OC  0x27  // pre OC ? guess!
#define D90_MECHA_STATUS_PRINT_OC      0x28  // O C?
#define D90_MECHA_STATUS_PRINT_x2f     0x2f  // ??
#define D90_MECHA_STATUS_PRINT_x38     0x38  // eject ?

#define D90_ERROR_STATUS_OK         0x00
#define D90_ERROR_STATUS_OK_WARMING 0x40
#define D90_ERROR_STATUS_OK_COOLING 0x80
#define D90_ERROR_STATUS_RIBBON     0x21
#define D90_ERROR_STATUS_PAPER      0x22
#define D90_ERROR_STATUS_PAP_RIB    0x23
#define D90_ERROR_STATUS_OPEN       0x29

struct mitsud90_job_query {
	uint8_t  hdr[4];  /* 1b 47 44 31 */
	uint16_t jobid;   /* BE */
} __attribute__((packed));

struct mitsud90_job_resp {
	uint8_t  hdr[4];  /* e4 47 44 31 */
	uint8_t  unk1;
	uint8_t  unk2;
	uint16_t unk3;
} __attribute__((packed));

struct mitsud90_job_hdr {
	uint8_t  hdr[6]; /* 1b 53 50 30 00 33 */
	uint16_t cols;   /* BE */
	uint16_t rows;   /* BE */
	uint8_t  waittime; /* 0-100 */
	uint8_t  unk[3]; /* 00 00 01 */ // XXX 00 01 might be the jobid?
	uint8_t  margincut; /* 1 for enabled, 0 for disabled */
	uint8_t  numcuts; /* # of cuts (0-3) but 0-8 legal */
/*@0x10*/
	struct {
		uint16_t position;  // BE, @ center
		uint8_t  margincut; /* 0 for double cut, 1 for single */
		uint8_t  zeropad;
	} cutlist[8] __attribute__((packed));  /* 3 is current legal max */
/*@x30*/uint8_t  overcoat;  /* 0 glossy, matte is 2 (D90) or 3 (M1) */
	uint8_t  quality;   /* 0 is automatic, 5 is "fast" on M1 */
	uint8_t  colorcorr; /* Always 1 on M1 */
	uint8_t  sharp_h;   /* Always 0 on M1 */
	uint8_t  sharp_v;   /* Always 0 on M1 */
	uint8_t  zero_b[5]; /* 0 on D90, on M1, zero_b[3] is the not-raw flag */
	struct {
/* @x3a */	uint8_t  on;      /* 0x01 when pano is on / always 0x02 on M1 / 0x03 on D90 panorama that needs backend processing */
		uint8_t  zero_a;
		uint8_t  total;   /* 2 or 3 */
		uint8_t  page;    /* 1, 2, 3 */
		uint16_t rows;    /* always 0x097c (BE), ie 2428 ie 8" print */
/* @x40 */	uint16_t rows2;   /* Always 0x30 less than pano_rows */
		uint16_t zero_b;  /* 0x0000 */
		uint16_t overlap; /* always 0x0258, ie 600 or 2 inches */
		uint8_t  unk[4];  /* 00 0c 00 06 */
	} pano __attribute__((packed));
	uint8_t zero_c[6];
/*@x50*/uint8_t unk_m1;   /* 00 on d90 & m1 Linux, 01 on m1 (windows) */
	uint8_t rgbrate;  /* M1 only, see below */
	uint8_t oprate;   /* M1 only, see below */
	uint8_t zero_fill[429];
} __attribute__((packed));

struct mitsud90_plane_hdr {
	uint8_t  hdr[6]; /* 1b 5a 54 01 00 09 */
	uint16_t origin_cols;  /* Leave at 0 */
	uint16_t origin_rows;  /* Leave at 0 */
	uint16_t cols;  /* BE */
	uint16_t rows;  /* BE */
	uint8_t  zero_a[6];
	uint16_t lamcols; /* BE (M1 only, OC=3) should be cols+origin_cols */
	uint16_t lamrows; /* BE (M1 only, OC=3) should be rows+origin_rows+12 */
	uint8_t  zero_b[8];
	uint8_t  unk_m1[8]; /* 07 e4 02 19 xx xx xx 00 always incrementing. timestamp? Only seen from win-generated jobs? */
	uint8_t  zero_fill[472];
} __attribute__((packed));

struct mitsud90_job_footer {
	uint8_t hdr[4]; /* 1b 42 51 31 */
	uint16_t seconds; /* BE, 0x0005 by default (windows), 0x00ff means don't wait */
} __attribute__((packed));

struct mitsud90_memcheck {
	uint8_t  hdr[6]; /* 1b 47 44 33 00 33 */
	uint16_t cols;   /* BE */
	uint16_t rows;   /* BE */
	uint8_t  waittime; /* 0-100 */
	uint8_t  unk[3]; /* 00 00 01  */
	uint8_t  zero_fill[498];
} __attribute__((packed));

struct mitsud90_memcheck_resp {
	uint8_t  hdr[4];   /* e4 47 44 43 */
	uint8_t  size_bad; /* 0x00 is ok */
	uint8_t  mem_bad;  /* 0x00 is ok */
} __attribute__((packed));

struct mitsuw5k_job_hdr {
	uint8_t hdr[4]; // 1b 53 50 30
	uint16_t cols;
	uint16_t rows;
	uint8_t  cuts;  // 0-2
	uint16_t cut1;
	uint16_t cut2;
	uint8_t single;  // 1:single page, 0:duplex
	uint8_t	finish;  // 0:gloss, 1:semi-gloss 2:matte
	uint8_t	finishback; //	0:gloss, 1:semi-gloss, 2:matte,	ff:none
	uint8_t	unk[2];  // XXX 01 00, 01 01, 01 02 seen on windows driver, latter two with duplex of some sort.  00 00 hardcoded with linux driver.
	uint8_t	colorconv;  //	1: off,	0: internal
	uint8_t  sharp_H;    // 0-8 or 0xff (ie printer)
	uint8_t  sharp_V;    // 0-8 or 0xff (ie printer)
/*@21*/	uint8_t  pad[512-21];
} __attribute__((packed));

struct mitsuw5k_plane_hdr {
	int8_t  hdr[4]; // 1b 5a 54 01
	uint8_t  zero[4];
	uint16_t cols;
	uint16_t rows;
	uint8_t  zero2;
	uint8_t  printout;  // 1 to start printing
	uint8_t  zero3;
/*@15*/	uint8_t  pad[512-15];
} __attribute__((packed));

